wrk/sync_res/wrk_status.txt
Running 20s test @ http://127.0.0.1:8080/v0/status
  2 threads and 1024 connections
  Thread calibration: mean lat.: 1.292ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.311ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.22ms  568.55us   3.70ms   64.08%
    Req/Sec     5.26k   449.58     7.11k    69.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.17ms
 75.000%    1.63ms
 90.000%    2.01ms
 99.000%    2.61ms
 99.900%    3.14ms
 99.990%    3.42ms
 99.999%    3.61ms
100.000%    3.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.090     0.000000            1         1.00
       0.511     0.100000         7413         1.11
       0.681     0.200000        14823         1.25
       0.839     0.300000        22243         1.43
       1.000     0.400000        29613         1.67
       1.168     0.500000        37003         2.00
       1.258     0.550000        40741         2.22
       1.348     0.600000        44415         2.50
       1.441     0.650000        48125         2.86
       1.534     0.700000        51831         3.33
       1.634     0.750000        55538         4.00
       1.686     0.775000        57361         4.44
       1.740     0.800000        59224         5.00
       1.795     0.825000        61067         5.71
       1.856     0.850000        62917         6.67
       1.928     0.875000        64767         8.00
       1.967     0.887500        65684         8.89
       2.007     0.900000        66626        10.00
       2.051     0.912500        67541        11.43
       2.097     0.925000        68469        13.33
       2.149     0.937500        69394        16.00
       2.175     0.943750        69872        17.78
       2.203     0.950000        70312        20.00
       2.237     0.956250        70770        22.86
       2.277     0.962500        71241        26.67
       2.327     0.968750        71701        32.00
       2.353     0.971875        71923        35.56
       2.383     0.975000        72172        40.00
       2.415     0.978125        72401        45.71
       2.451     0.981250        72618        53.33
       2.501     0.984375        72857        64.00
       2.525     0.985938        72967        71.11
       2.553     0.987500        73082        80.00
       2.585     0.989062        73199        91.43
       2.627     0.990625        73322       106.67
       2.663     0.992188        73426       128.00
       2.689     0.992969        73489       142.22
       2.709     0.993750        73543       160.00
       2.739     0.994531        73601       182.86
       2.771     0.995313        73659       213.33
       2.805     0.996094        73717       256.00
       2.833     0.996484        73747       284.44
       2.865     0.996875        73775       320.00
       2.893     0.997266        73802       365.71
       2.943     0.997656        73832       426.67
       2.997     0.998047        73861       512.00
       3.029     0.998242        73875       568.89
       3.055     0.998437        73889       640.00
       3.081     0.998633        73903       731.43
       3.125     0.998828        73919       853.33
       3.149     0.999023        73932      1024.00
       3.167     0.999121        73939      1137.78
       3.189     0.999219        73948      1280.00
       3.201     0.999316        73955      1462.86
       3.213     0.999414        73961      1706.67
       3.249     0.999512        73969      2048.00
       3.263     0.999561        73972      2275.56
       3.279     0.999609        73976      2560.00
       3.299     0.999658        73979      2925.71
       3.321     0.999707        73983      3413.33
       3.341     0.999756        73986      4096.00
       3.349     0.999780        73988      4551.11
       3.361     0.999805        73990      5120.00
       3.391     0.999829        73992      5851.43
       3.411     0.999854        73994      6826.67
       3.413     0.999878        73995      8192.00
       3.419     0.999890        73996      9102.22
       3.425     0.999902        73997     10240.00
       3.447     0.999915        73998     11702.86
       3.449     0.999927        73999     13653.33
       3.453     0.999939        74000     16384.00
       3.453     0.999945        74000     18204.44
       3.465     0.999951        74001     20480.00
       3.465     0.999957        74001     23405.71
       3.501     0.999963        74002     27306.67
       3.501     0.999969        74002     32768.00
       3.501     0.999973        74002     36408.89
       3.611     0.999976        74003     40960.00
       3.611     0.999979        74003     46811.43
       3.611     0.999982        74003     54613.33
       3.611     0.999985        74003     65536.00
       3.611     0.999986        74003     72817.78
       3.703     0.999988        74004     81920.00
       3.703     1.000000        74004          inf
#[Mean    =        1.222, StdDeviation   =        0.569]
#[Max     =        3.702, Total count    =        74004]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  186847 requests in 20.00s, 11.05MB read
  Socket errors: connect 5, read 0, write 0, timeout 40
Requests/sec:   9342.02
Transfer/sec:    565.63KB