wrk/sync_res/wrk_status_under_put.txt
Running 20s test @ http://127.0.0.1:8080/v0/status
  2 threads and 1024 connections
  Thread calibration: mean lat.: 0.919ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.917ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.91ms  520.54us  14.90ms   75.86%
    Req/Sec     5.18k   407.03    11.70k    75.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.89ms
 75.000%    1.22ms
 90.000%    1.44ms
 99.000%    1.99ms
 99.900%    4.22ms
 99.990%   13.93ms
 99.999%   14.81ms
100.000%   14.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.036     0.000000            1         1.00
       0.331     0.100000         7415         1.11
       0.486     0.200000        14859         1.25
       0.629     0.300000        22210         1.43
       0.765     0.400000        29650         1.67
       0.894     0.500000        37023         2.00
       0.959     0.550000        40742         2.22
       1.024     0.600000        44439         2.50
       1.089     0.650000        48146         2.86
       1.156     0.700000        51874         3.33
       1.223     0.750000        55573         4.00
       1.255     0.775000        57397         4.44
       1.288     0.800000        59235         5.00
       1.321     0.825000        61075         5.71
       1.357     0.850000        62965         6.67
       1.396     0.875000        64784         8.00
       1.418     0.887500        65703         8.89
       1.443     0.900000        66641        10.00
       1.472     0.912500        67553        11.43
       1.509     0.925000        68489        13.33
       1.554     0.937500        69416        16.00
       1.580     0.943750        69873        17.78
       1.611     0.950000        70330        20.00
       1.644     0.956250        70793        22.86
       1.683     0.962500        71255        26.67
       1.732     0.968750        71721        32.00
       1.762     0.971875        71947        35.56
       1.794     0.975000        72178        40.00
       1.825     0.978125        72407        45.71
       1.862     0.981250        72639        53.33
       1.900     0.984375        72873        64.00
       1.923     0.985938        72990        71.11
       1.948     0.987500        73104        80.00
       1.972     0.989062        73220        91.43
       1.996     0.990625        73333       106.67
       2.029     0.992188        73453       128.00
       2.041     0.992969        73506       142.22
       2.057     0.993750        73569       160.00
       2.079     0.994531        73623       182.86
       2.101     0.995313        73683       213.33
       2.127     0.996094        73740       256.00
       2.141     0.996484        73770       284.44
       2.159     0.996875        73799       320.00
       2.179     0.997266        73828       365.71
       2.205     0.997656        73854       426.67
       2.241     0.998047        73883       512.00
       2.261     0.998242        73898       568.89
       2.323     0.998437        73911       640.00
       2.787     0.998633        73925       731.43
       3.475     0.998828        73940       853.33
       4.511     0.999023        73954      1024.00
       5.435     0.999121        73961      1137.78
       6.503     0.999219        73969      1280.00
       7.483     0.999316        73976      1462.86
       8.511     0.999414        73983      1706.67
       9.519     0.999512        73990      2048.00
      10.127     0.999561        73994      2275.56
      10.607     0.999609        73998      2560.00
      11.247     0.999658        74001      2925.71
      12.223     0.999707        74005      3413.33
      12.599     0.999756        74009      4096.00
      12.607     0.999780        74010      4551.11
      12.863     0.999805        74012      5120.00
      13.527     0.999829        74014      5851.43
      13.871     0.999854        74016      6826.67
      13.879     0.999878        74017      8192.00
      13.919     0.999890        74018      9102.22
      13.927     0.999902        74019     10240.00
      14.431     0.999915        74020     11702.86
      14.455     0.999927        74021     13653.33
      14.639     0.999939        74022     16384.00
      14.639     0.999945        74022     18204.44
      14.719     0.999951        74023     20480.00
      14.719     0.999957        74023     23405.71
      14.735     0.999963        74024     27306.67
      14.735     0.999969        74024     32768.00
      14.735     0.999973        74024     36408.89
      14.807     0.999976        74025     40960.00
      14.807     0.999979        74025     46811.43
      14.807     0.999982        74025     54613.33
      14.807     0.999985        74025     65536.00
      14.807     0.999986        74025     72817.78
      14.903     0.999988        74026     81920.00
      14.903     1.000000        74026          inf
#[Mean    =        0.911, StdDeviation   =        0.521]
#[Max     =       14.896, Total count    =        74026]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  186861 requests in 20.00s, 11.05MB read
  Socket errors: connect 5, read 0, write 0, timeout 40
Requests/sec:   9342.81
Transfer/sec:    565.68KB